// pages/home-page/questionnaire/questionnaires/quest5/quest5.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    questionList:[
      {
        title:'您的性别？',
        items:[
        {value:'男',name:'男'},
        {value:'女',name:'女'}]
      },
      {
        title:'您所在的年级是',
        items:[
        {value:'大一',name:'大一'},
        {value:'大二',name:'大二'},
        {value:'大三',name:'大三'},
        {value:'大四',name:'大四'}]
      },
      {
        title:'您的所在专业是？',
        items:[
        {value:'工商管理',name:'工商管理'},
        {value:'市场营销',name:'市场营销'},
        {value:'人力资源',name:'人力资源'},
        {value:'电子商务',name:'电子商务'},
        {value:'信息管理',name:'信息管理'}]
      },
      {
        title:'您的所在班级是？',
        items:[
        {value:'1班',name:'1班'},
        {value:'2班',name:'2班'},
        {value:'3班',name:'3班'},
        {value:'4班',name:'4班'},
        {value:'5班',name:'5班'},
        {value:'6班',name:'6班'}]
      },
      {
        title:'根据自己最近的感受情况选择最符合自己的选项陈述',
        items:[
        {value:'我不感到悲伤',name:'我不感到悲伤'},
        {value:'我经常感到悲伤',name:'我经常感到悲伤'},
        {value:'我一直感到悲伤',name:'我一直感到悲伤'},
        {value:'我太悲伤或太难过，到了难以忍受程度',name:'我太悲伤或太难过，到了难以忍受程度'}]
      },
      {
        title:'根据自己最近的感受情况选择最符合自己的选项陈述',
        items:[
        {value:'我没有对未来失去信心',name:'我没有对未来失去信心'},
        {value:'我比以往更加对未来没有信心',name:'我比以往更加对未来没有信心'},
        {value:'我感到前景黯淡',name:'我感到前景黯淡'},
        {value:'我觉得将来毫无希望，并且只会变得更加糟糕',name:'我觉得将来毫无希望，并且只会变得更加糟糕'}]
      },
      {
        title:'根据自己最近的感受情况选择最符合自己的选项陈述',
        items:[
        {value:'我不觉得自己是个失败者',name:'我不觉得自己是个失败者'},
        {value:'我的失败比较多',name:'我的失败比较多'},
        {value:'回首往事，我看到一大堆的失败',name:'回首往事，我看到一大堆的失败'},
        {value:'我觉得自己是一个彻底的失败者',name:'我觉得自己是一个彻底的失败者'}]
      },
      {
        title:'根据自己最近的感受情况选择最符合自己的选项陈述',
        items:[
        {value:'我和过去一样能从喜欢的事情中得到乐趣',name:'我和过去一样能从喜欢的事情中得到乐趣'},
        {value:'我不能像过去一样从喜欢的事情中得到乐趣',name:'我不能像过去一样从喜欢的事情中得到乐趣'},
        {value:'我从过去喜欢的事情中获得的快乐很少',name:'我从过去喜欢的事情中获得的快乐很少'},
        {value:'我完全不能从过去喜欢的事情中获得快乐',name:'我完全不能从过去喜欢的事情中获得快乐'}]
      },
      {
        title:'根据自己最近的感受情况选择最符合自己的选项陈述',
        items:[
        {value:'我没有特别的内疚感',name:'我没有特别的内疚感'},
        {value:'我对自己做过或该做但没做的许多事感到内疚',name:'我对自己做过或该做但没做的许多事感到内疚'},
        {value:'在大部分时间里我都感到内疚',name:'在大部分时间里我都感到内疚'},
        {value:'我任何时候都感到内疚',name:'我任何时候都感到内疚'}]
      },
      {
        title:'根据自己最近的感受情况选择最符合自己的选项陈述',
        items:[
        {value:'我没觉得自己在受惩罚',name:'我没觉得自己在受惩罚'},
        {value:'我觉得自己可能会受到惩罚(可能会但是未发生)',name:'我觉得自己可能会受到惩罚(可能会但是未发生)'},
        {value:'我觉得自己会受到惩罚(确定会但是未发生)',name:'我觉得自己会受到惩罚(确定会但是未发生)'},
        {value:'我觉得正在受到惩罚(已经发生)',name:'我觉得正在受到惩罚(已经发生)'}]
      },
      {
        title:'根据自己最近的感受情况选择最符合自己的选项陈述',
        items:[
        {value:'我对自己的感觉同过去一样',name:'我对自己的感觉同过去一样'},
        {value:'我对自己失去了信心',name:'我对自己失去了信心'},
        {value:'我对自己感到失望',name:'我对自己感到失望'},
        {value:'我讨厌我自己',name:'我讨厌我自己'}]
      },
      {
        title:'根据自己最近的感受情况选择最符合自己的选项陈述',
        items:[
        {value:'与过去相比，我没有更多的责备或批评自己',name:'与过去相比，我没有更多的责备或批评自己'},
        {value:'我比过去责备自己更多',name:'我比过去责备自己更多'},
        {value:'只要我有过失，我就责备自己',name:'只要我有过失，我就责备自己'},
        {value:'只要发生不好的事情，我就责备自己',name:'只要发生不好的事情，我就责备自己'}]
      },
      {
        title:'根据自己最近的感受情况选择最符合自己的选项陈述',
        items:[
        {value:'我没有任何自杀的想法',name:'我没有任何自杀的想法'},
        {value:'我有自杀的想法，但我不会去做',name:'我有自杀的想法，但我不会去做'},
        {value:'我想自杀',name:'我想自杀'},
        {value:'如果有机会我就会自杀',name:'如果有机会我就会自杀'}]
      },
      {
        title:'根据自己最近的感受情况选择最符合自己的选项陈述',
        items:[
        {value:'和过去比较，我最近哭或想要哭的次数没有增加多少',name:'和过去比较，我最近哭或想要哭的次数没有增加多少'},
        {value:'和过去比较，我最近比过去哭或想要哭的次数增加了一些',name:'和过去比较，我最近比过去哭或想要哭的次数增加了一些'},
        {value:'和过去比较，最近任何小事都会让我哭或想要哭',name:'和过去比较，最近任何小事都会让我哭或想要哭'},
        {value:'和过去比较，最近我一直特别想要哭，但却又哭不出来',name:'和过去比较，最近我一直特别想要哭，但却又哭不出来'}]
      },
      {
        title:'根据自己最近的感受情况选择最符合自己的选项陈述',
        items:[
        {value:'我现在没有比过去更加烦躁',name:'我现在没有比过去更加烦躁'},
        {value:'我现在比过去更容易烦躁',name:'我现在比过去更容易烦躁'},
        {value:'我最近非常烦躁或不安，很难保持安静',name:'我最近非常烦躁或不安，很难保持安静'},
        {value:'我非常烟躁不安，必须不停走动或做事情',name:'我非常烟躁不安，必须不停走动或做事情'}]
      },
      {
        title:'根据自己最近的感受情况选择最符合自己的选项陈述',
        items:[
        {value:'我对其他人或活动没有失去兴趣',name:'我对其他人或活动没有失去兴趣'},
        {value:'和过去相比，我对其他人或事的兴趣减少了',name:'和过去相比，我对其他人或事的兴趣减少了'},
        {value:'我失去了对其他人或事的大部分兴趣',name:'我失去了对其他人或事的大部分兴趣'},
        {value:'现在任何事情都很难引起我的兴趣',name:'现在任何事情都很难引起我的兴趣'}]
      },
      {
        title:'根据自己最近的感受情况选择最符合自己的选项陈述',
        items:[
        {value:'我现在能和过去一样作决定(不会犹豫)',name:'我现在能和过去一样作决定(不会犹豫)'},
        {value:'我现在作决定比以前困难(轻度犹豫)',name:'我现在作决定比以前困难(轻度犹豫)'},
        {value:'我作决定比以前困难了很多(中度犹豫)',name:'我作决定比以前困难了很多(中度犹豫)'},
        {value:'我现在作任何决定都很困难(重度犹豫)',name:'我现在作任何决定都很困难(重度犹豫)'}]
      },
      {
        title:'根据自己最近的感受情况选择最符合自己的选项陈述',
        items:[
        {value:'我不觉得自己没有价值',name:'我不觉得自己没有价值'},
        {value:'我认为自己不如过去有价值或有用了',name:'我认为自己不如过去有价值或有用了'},
        {value:'我觉得自己不如别人有价值',name:'我觉得自己不如别人有价值'},
        {value:'我觉得自己毫无价值',name:'我觉得自己毫无价值'}]
      },
      {
        title:'根据自己最近的感受情况选择最符合自己的选项陈述',
        items:[
        {value:'我和过去一样有精力',name:'我和过去一样有精力'},
        {value:'我不如从前有精力',name:'我不如从前有精力'},
        {value:'我没有精力做很多事情',name:'我没有精力做很多事情'},
        {value:'我做任何事情都没有足够的精力',name:'我做任何事情都没有足够的精力'}]
      },
      {
        title:'根据自己最近的感受情况选择最符合自己的选项陈述',
        items:[
        {value:'我没觉得睡眠有什么变化',name:'我没觉得睡眠有什么变化'},
        {value:'我的睡眠比过去略少，或略多',name:'我的睡眠比过去略少，或略多'},
        {value:'我的睡眠比以前少了很多，或多了很多',name:'我的睡眠比以前少了很多，或多了很多'},
        {value:'我根本无法睡觉，或我一直想睡觉',name:'我根本无法睡觉，或我一直想睡觉'}]
      },
      {
        title:'根据自己最近的感受情况选择最符合自己的选项陈述',
        items:[
        {value:'我并不比过去容易发火',name:'我并不比过去容易发火'},
        {value:'与过去相比，我比较容易发火',name:'与过去相比，我比较容易发火'},
        {value:'与过去相比，我非常容易发火',name:'与过去相比，我非常容易发火'},
        {value:'我现在随时都很容易发火',name:'我现在随时都很容易发火'}]
      },
      {
        title:'根据自己最近的感受情况选择最符合自己的选项陈述',
        items:[
        {value:'我没觉得食欲有什么变化',name:'我没觉得食欲有什么变化'},
        {value:'我的食欲比过去略差，或略好',name:'我的食欲比过去略差，或略好'},
        {value:'我的食欲比去过去差了很多，或好很多',name:'我的食欲比去过去差了很多，或好很多'},
        {value:'我完全没有食欲，或总是非常想吃东西',name:'我完全没有食欲，或总是非常想吃东西'}]
      },
      {
        title:'根据自己最近的感受情况选择最符合自己的选项陈述',
        items:[
        {value:'我和过去一样可以集中精神',name:'我和过去一样可以集中精神'},
        {value:'我无法像过去一样集中精神',name:'我无法像过去一样集中精神'},
        {value:'任何事情都很难让我长时间集中精神',name:'任何事情都很难让我长时间集中精神'},
        {value:'任何事情都无法让我集中精神',name:'任何事情都无法让我集中精神'}]
      },
      {
        title:'根据自己最近的感受情况选择最符合自己的选项陈述',
        items:[
        {value:'我没觉得比过去累或乏力',name:'我没觉得比过去累或乏力'},
        {value:'我比过去更容易累或乏力',name:'我比过去更容易累或乏力'},
        {value:'因为太累或者太乏力，很多过去常做的事情不能做了',name:'因为太累或者太乏力，很多过去常做的事情不能做了'},
        {value:'因为太累或者太乏力，几乎全部过去常做的事情都不能做了',name:'因为太累或者太乏力，几乎全部过去常做的事情都不能做了'}]
      },
    ],
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})